//f(n)函数的定义为0~n中包含的1的个数
//f(13)是0~13中包含1的有 1，10，11，12，13，所以f(13)=6
//求f(n)=n的最小n的值
//google

#include<stdio.h>

int main()
{
	int n=999999;
	int a1,a2,a3,a4,a5,a6,a, b, c, d, x=0, i;
	
	for(i=1;i<=n;i++)
	{
		a5= i / 100000;
		a6= i % 100000 / 10000;
		a = i % 100000 % 10000 / 1000;//千 
		b = i % 100000 % 10000 % 1000 / 100;//百 
		c = i % 100000 % 10000 % 1000 % 100 / 10;//十 
		d = i % 100000 % 10000 % 1000 % 100 % 10;//个
		if(a3==1)	
		  x++;
		if(a4==1)	
		  x++;
		if(a5==1)	
		  x++;
		if(a6==1)	
		  x++;
		if(a==1)	
		  x++;
		if(b==1)	
		  x++;	 
		if(c==1)	
		  x++;	 
		if(d==1)	
		  x++;
		if(x==i && x!=1)
		  {printf("%d", x);
		  break;}	 	 	 	 
	}		
	return 0;
}
