//单位转换程序，输入值和原单位，新单位，返回新单位下的值。
//重量单位：Kg, g, lb, gr,......
//压力单位：Pa, MPa, psi,......
//长度单位：m, km, ft, in,......
//其它单位：md, cp,......
//还有很多单位转换，有些单位是其它单位组合出来的
double units[5][100];
//功率 power
/* 
1	瓦特(w)
1	焦耳/秒(J/s)
1	牛顿·米/秒(N·m/s)
0.0013596	米制马力(ps)
0.000239	千卡/秒(kcal/s)
0.001	千瓦(kW)
0.001341	英制马力(hp)
0.7375621	英尺·磅/秒(ft·lb/s)
0.0009478	英热单位/秒(Btu/s)
0.1019716	公斤·米/秒(kg·m/s)
*/ 
units[0] = {1, 1, 1, 0.0013596, 0.000239, 0.001, 0.001341, 0.7375621, 0.0009478, 0.1019716};

//压强 pressure 
/*
1		帕(pa) 
0.01	百帕(hpa)
0.01	毫巴(mbar)
0.001	千帕(kpa)
0.00001	巴(bar)
1e-6	兆帕(MPa)
0.0075006	毫米汞柱(mmHg)
0.101972	毫米水柱
0.0002953	英寸汞柱(in Hg)
0.000145	磅力/平方英寸(psi)
9.8692e-6	标准大气压(atm)
0.0208854	磅力/平方英尺(psf)
0.0000102	公斤力/平方厘米(kgf/cm2)
0.1019716	公斤力/平方米(kgf/㎡)
*/
units[1] = {1, 0.01, 0.01, 0.001, 0.00001, 0.000001, 0.0075006, 0.101972, 
			0.0002953, 0.000145, 9.8692e-6, 0.0208854, 0.0000102, 0.1019716};
 
//温度 temperature
/*
1		摄氏度(℃) 
33.8	华氏度(℉)
274.15	开氏度(K)
0.8	列氏度(°Re)
493.47	兰氏度(°R)
*/
units[2] = {1, 33.8, 274.15, 0.8, 493.47};

//体积 volume
/*
1		立方米(m3)
1000	升(l)
1000000	毫升(ml)
1000000	立方厘米(cm3)
1000	立方分米(dm3)
10000	分升(dl)
100000	厘升(cl)
10	公石(hl)
1000000000	微升(ul)
1000000000	立方毫米(mm3)
61023.8445022	立方英寸(cu in)
1.3079528	立方码(cu yd)
35.3147248	立方英尺(cu ft)
0.0008107	亩英尺
219.9691573	英制加仑(uk gal)
264.1720524	美制加仑(us gal)
35198.873636	英制液体盎司(oz)
34164.6737274	美制液体盎司(oz)
*/
units[3] = {1, 1000, 1000000, 1000000, 1000, 10000, 100000, 10, 1000000000,
			1000000000, 61023.8445022, 1.3079528, 35.3147248, 0.0008107,
			219.9691573, 264.1720524, 35198.873636, 34164.6737274};

//速度 velocity
/*
1	米/秒(m/s)
3.6	千米/时(km/h)
0.001	千米/秒(km/s)
0.0029386	马赫(mach)
39.370079	英寸/秒(in/s)
3.3356e-9	光速(c)
2.236936	英里/时(mile/h)
*/
units[4] = {1, 3.6, 0.001, 0.0029386, 39.370079, 0.0000000033356, 2.236936};
